@sethvargo 

```
zsombor@MacBook-Pro cw-en-verification-9 % terraform apply
module.en.random_id.db-apikey-sig-hmac: Refreshing state... [id=LCBNjbuR09FPXMMfQzGq9ki1uyXFn03YCjKiY0ELwPnKUqSZwOXW8pkpfu6g-pI5eSNTE1KJ2mqs90cj2JryHfGsXzcri_pmC9345gkNEiP4E5Nth3vtCIgInVLBTtZPqjkrBWRgE8w6ux4EASpwmp2TDL48BuaVsfbyGWJuo7Y]
module.en.random_string.db-name: Refreshing state... [id=prmvn]
module.en.random_id.db-apikey-db-hmac: Refreshing state... [id=MBsXmkuyo6bBvvPAEM31Q2mlZ7nGYnoZc9ILzIgJc7ttSHMUinqdWBUNi8UI88jyuYwIWHU4W-LREOl3by2hvFDNKvWRc3xik8DaLIKjgMe5uk2vtJK9XEgGGqH3AGNfvwVp3rWXWYr1pRm7AMRqVYEtXvstClaY1rF6NL4_gQs]
module.en.random_password.db-password: Refreshing state... [id=none]
module.en.google_service_account.apiserver: Refreshing state... [id=projects/cw-en-verification-9/serviceAccounts/en-verification-apiserver-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.random_id.cookie-hmac-key: Refreshing state... [id=LI8i_AiwPtpty-KsB0sT6u7IWZpDsORp6vyCB3bqKKk]
module.en.google_service_account.server: Refreshing state... [id=projects/cw-en-verification-9/serviceAccounts/en-verification-server-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_service_account.e2e-runner: Refreshing state... [id=projects/cw-en-verification-9/serviceAccounts/en-verification-e2e-runner-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.random_id.csrf-token: Refreshing state... [id=aIk1JTTOd71L1c70ssLJ61OeDvFKtg6j4E4NhaU6g5g]
module.en.random_id.cache-hmac-key: Refreshing state... [id=zXowsL5CuiBjanWRvX4_-5RHEJSu5VAwp6kJJ5TAsKqpnA25nDuIbgBU3o_iizA3FUzLXjmk0wPXlV-VK3cbq4AzKomOA1Q9McwKp8Tq6I05AybFoj2frisabak6FvlObb-r1Z3U8hgcB8pQV-nKEP4P3bmlOgO2zT8jtvVcvbw]
module.en.google_project_service.services["cloudscheduler.googleapis.com"]: Refreshing state... [id=cw-en-verification-9/cloudscheduler.googleapis.com]
module.en.google_service_account.cleanup: Refreshing state... [id=projects/cw-en-verification-9/serviceAccounts/en-verification-cleanup-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.random_id.cookie-encryption-key: Refreshing state... [id=ySSNgPwLOVnhGNvayeZqfgGfeEtpr4LB3qFu95kG3V4]
module.en.google_service_account.adminapi: Refreshing state... [id=projects/cw-en-verification-9/serviceAccounts/en-verification-adminapi-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.random_id.db-verification-code-hmac: Refreshing state... [id=MZzFiKClWLcfeZS2nGdZLQTnvG4Mt4j72k3J7MHZUsKc5aJ2UUb-DPghYRcWjNNGy16fYK_JcH1ImpTIDJPat2_8cuI1f3P_x2hszLbH0Rsr-smojfJF3OZ6XfgI55I78EsXWxEdcFEMqGzVmbqqlAj32klOs8hh0BW_w8Tw41w]
module.en.google_project_service.services["cloudkms.googleapis.com"]: Refreshing state... [id=cw-en-verification-9/cloudkms.googleapis.com]
module.en.google_project_service.services["cloudidentity.googleapis.com"]: Refreshing state... [id=cw-en-verification-9/cloudidentity.googleapis.com]
module.en.google_project_service.services["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=cw-en-verification-9/cloudresourcemanager.googleapis.com]
module.en.google_project_service.services["secretmanager.googleapis.com"]: Refreshing state... [id=cw-en-verification-9/secretmanager.googleapis.com]
module.en.google_project_service.services["identitytoolkit.googleapis.com"]: Refreshing state... [id=cw-en-verification-9/identitytoolkit.googleapis.com]
module.en.google_project_service.services["containerregistry.googleapis.com"]: Refreshing state... [id=cw-en-verification-9/containerregistry.googleapis.com]
module.en.google_project_service.services["cloudbuild.googleapis.com"]: Refreshing state... [id=cw-en-verification-9/cloudbuild.googleapis.com]
module.en.google_project_service.services["servicenetworking.googleapis.com"]: Refreshing state... [id=cw-en-verification-9/servicenetworking.googleapis.com]
module.en.google_project_service.services["vpcaccess.googleapis.com"]: Refreshing state... [id=cw-en-verification-9/vpcaccess.googleapis.com]
module.en.data.google_project.project: Refreshing state... [id=projects/cw-en-verification-9]
module.en.google_project_service.services["compute.googleapis.com"]: Refreshing state... [id=cw-en-verification-9/compute.googleapis.com]
module.en.google_project_service.services["iam.googleapis.com"]: Refreshing state... [id=cw-en-verification-9/iam.googleapis.com]
module.en.google_project_service.services["storage.googleapis.com"]: Refreshing state... [id=cw-en-verification-9/storage.googleapis.com]
module.en.google_project_service.services["run.googleapis.com"]: Refreshing state... [id=cw-en-verification-9/run.googleapis.com]
module.en.google_project_service.services["sql-component.googleapis.com"]: Refreshing state... [id=cw-en-verification-9/sql-component.googleapis.com]
module.en.google_project_service.services["redis.googleapis.com"]: Refreshing state... [id=cw-en-verification-9/redis.googleapis.com]
module.en.google_project_service.services["firebase.googleapis.com"]: Refreshing state... [id=cw-en-verification-9/firebase.googleapis.com]
module.en.google_project_service.services["sqladmin.googleapis.com"]: Refreshing state... [id=cw-en-verification-9/sqladmin.googleapis.com]
module.en.google_compute_url_map.urlmap-http: Refreshing state... [id=projects/cw-en-verification-9/global/urlMaps/https-redirect]
module.en.google_project_iam_member.e2e-runner-observability["roles/cloudtrace.agent"]: Refreshing state... [id=cw-en-verification-9/roles/cloudtrace.agent/serviceaccount:en-verification-e2e-runner-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_project_iam_member.e2e-runner-observability["roles/stackdriver.resourceMetadata.writer"]: Refreshing state... [id=cw-en-verification-9/roles/stackdriver.resourceMetadata.writer/serviceaccount:en-verification-e2e-runner-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_project_iam_member.e2e-runner-observability["roles/monitoring.metricWriter"]: Refreshing state... [id=cw-en-verification-9/roles/monitoring.metricWriter/serviceaccount:en-verification-e2e-runner-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_project_iam_member.e2e-runner-observability["roles/logging.logWriter"]: Refreshing state... [id=cw-en-verification-9/roles/logging.logWriter/serviceaccount:en-verification-e2e-runner-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_project_iam_member.adminapi-observability["roles/stackdriver.resourceMetadata.writer"]: Refreshing state... [id=cw-en-verification-9/roles/stackdriver.resourceMetadata.writer/serviceaccount:en-verification-adminapi-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_project_iam_member.adminapi-observability["roles/logging.logWriter"]: Refreshing state... [id=cw-en-verification-9/roles/logging.logWriter/serviceaccount:en-verification-adminapi-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_project_iam_member.adminapi-observability["roles/cloudtrace.agent"]: Refreshing state... [id=cw-en-verification-9/roles/cloudtrace.agent/serviceaccount:en-verification-adminapi-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_project_iam_member.adminapi-observability["roles/monitoring.metricWriter"]: Refreshing state... [id=cw-en-verification-9/roles/monitoring.metricWriter/serviceaccount:en-verification-adminapi-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_project_iam_member.cleanup-observability["roles/monitoring.metricWriter"]: Refreshing state... [id=cw-en-verification-9/roles/monitoring.metricWriter/serviceaccount:en-verification-cleanup-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_project_iam_member.cleanup-observability["roles/stackdriver.resourceMetadata.writer"]: Refreshing state... [id=cw-en-verification-9/roles/stackdriver.resourceMetadata.writer/serviceaccount:en-verification-cleanup-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_project_iam_member.cleanup-observability["roles/logging.logWriter"]: Refreshing state... [id=cw-en-verification-9/roles/logging.logWriter/serviceaccount:en-verification-cleanup-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_project_iam_member.cleanup-observability["roles/cloudtrace.agent"]: Refreshing state... [id=cw-en-verification-9/roles/cloudtrace.agent/serviceaccount:en-verification-cleanup-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_project_iam_member.server-observability["roles/monitoring.metricWriter"]: Refreshing state... [id=cw-en-verification-9/roles/monitoring.metricWriter/serviceaccount:en-verification-server-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_project_iam_member.apiserver-observability["roles/stackdriver.resourceMetadata.writer"]: Refreshing state... [id=cw-en-verification-9/roles/stackdriver.resourceMetadata.writer/serviceaccount:en-verification-apiserver-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_project_iam_member.apiserver-observability["roles/cloudtrace.agent"]: Refreshing state... [id=cw-en-verification-9/roles/cloudtrace.agent/serviceaccount:en-verification-apiserver-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_project_iam_member.server-observability["roles/cloudtrace.agent"]: Refreshing state... [id=cw-en-verification-9/roles/cloudtrace.agent/serviceaccount:en-verification-server-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_project_iam_member.firebase-admin: Refreshing state... [id=cw-en-verification-9/roles/firebaseauth.admin/serviceaccount:en-verification-server-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_project_iam_member.apiserver-observability["roles/logging.logWriter"]: Refreshing state... [id=cw-en-verification-9/roles/logging.logWriter/serviceaccount:en-verification-apiserver-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_project_iam_member.apiserver-observability["roles/monitoring.metricWriter"]: Refreshing state... [id=cw-en-verification-9/roles/monitoring.metricWriter/serviceaccount:en-verification-apiserver-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_project_iam_member.server-observability["roles/logging.logWriter"]: Refreshing state... [id=cw-en-verification-9/roles/logging.logWriter/serviceaccount:en-verification-server-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_project_iam_member.server-observability["roles/stackdriver.resourceMetadata.writer"]: Refreshing state... [id=cw-en-verification-9/roles/stackdriver.resourceMetadata.writer/serviceaccount:en-verification-server-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_service_account.e2e-runner-invoker: Refreshing state... [id=projects/cw-en-verification-9/serviceAccounts/en-e2e-runner-invoker-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_service_account.cleanup-invoker: Refreshing state... [id=projects/cw-en-verification-9/serviceAccounts/en-cleanup-invoker-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_app_engine_application.app: Refreshing state... [id=cw-en-verification-9]
module.en.google_vpc_access_connector.connector: Refreshing state... [id=projects/cw-en-verification-9/locations/us-central1/connectors/serverless-vpc-connector]
module.en.google_firebase_project.default: Refreshing state... [id=projects/cw-en-verification-9]
module.en.google_service_account_iam_member.cloudbuild-deploy-apiserver: Refreshing state... [id=projects/cw-en-verification-9/serviceAccounts/en-verification-apiserver-sa@cw-en-verification-9.iam.gserviceaccount.com/roles/iam.serviceAccountUser/serviceaccount:295454028483@cloudbuild.gserviceaccount.com]
module.en.google_secret_manager_secret.db-secret["sslkey"]: Refreshing state... [id=projects/cw-en-verification-9/secrets/db-sslkey]
module.en.google_secret_manager_secret.db-secret["sslrootcert"]: Refreshing state... [id=projects/cw-en-verification-9/secrets/db-sslrootcert]
module.en.google_secret_manager_secret.db-secret["password"]: Refreshing state... [id=projects/cw-en-verification-9/secrets/db-password]
module.en.google_secret_manager_secret.db-secret["sslcert"]: Refreshing state... [id=projects/cw-en-verification-9/secrets/db-sslcert]
module.en.google_service_account_iam_member.cloudbuild-deploy-e2e-runner: Refreshing state... [id=projects/cw-en-verification-9/serviceAccounts/en-verification-e2e-runner-sa@cw-en-verification-9.iam.gserviceaccount.com/roles/iam.serviceAccountUser/serviceaccount:295454028483@cloudbuild.gserviceaccount.com]
module.en.google_service_account_iam_member.cloudbuild-deploy-cleanup: Refreshing state... [id=projects/cw-en-verification-9/serviceAccounts/en-verification-cleanup-sa@cw-en-verification-9.iam.gserviceaccount.com/roles/iam.serviceAccountUser/serviceaccount:295454028483@cloudbuild.gserviceaccount.com]
module.en.google_secret_manager_secret.db-apikey-db-hmac: Refreshing state... [id=projects/cw-en-verification-9/secrets/db-apikey-db-hmac]
module.en.google_secret_manager_secret.db-apikey-sig-hmac: Refreshing state... [id=projects/cw-en-verification-9/secrets/db-apikey-sig-hmac]
module.en.google_project_iam_member.cloudbuild-deploy: Refreshing state... [id=cw-en-verification-9/roles/run.admin/serviceaccount:295454028483@cloudbuild.gserviceaccount.com]
module.en.google_secret_manager_secret.cache-hmac-key: Refreshing state... [id=projects/cw-en-verification-9/secrets/cache-hmac-key]
module.en.google_storage_bucket.cloudbuild-cache: Refreshing state... [id=cw-en-verification-9-cloudbuild-cache]
module.en.google_secret_manager_secret.cookie-encryption-key: Refreshing state... [id=projects/cw-en-verification-9/secrets/cookie-encryption-key]
module.en.google_project_iam_member.cloudbuild-sql: Refreshing state... [id=cw-en-verification-9/roles/cloudsql.client/serviceaccount:295454028483@cloudbuild.gserviceaccount.com]
module.en.google_secret_manager_secret.db-verification-code-hmac: Refreshing state... [id=projects/cw-en-verification-9/secrets/db-verification-code-hmac]
module.en.google_secret_manager_secret.cookie-hmac-key: Refreshing state... [id=projects/cw-en-verification-9/secrets/cookie-hmac-key]
module.en.google_service_account_iam_member.cloudbuild-deploy-adminapi: Refreshing state... [id=projects/cw-en-verification-9/serviceAccounts/en-verification-adminapi-sa@cw-en-verification-9.iam.gserviceaccount.com/roles/iam.serviceAccountUser/serviceaccount:295454028483@cloudbuild.gserviceaccount.com]
module.en.google_compute_global_address.private_ip_address: Refreshing state... [id=projects/cw-en-verification-9/global/addresses/private-ip-address]
module.en.google_kms_key_ring.verification: Refreshing state... [id=projects/cw-en-verification-9/locations/us-central1/keyRings/verification]
module.en.google_service_account_iam_member.cloudbuild-deploy-server: Refreshing state... [id=projects/cw-en-verification-9/serviceAccounts/en-verification-server-sa@cw-en-verification-9.iam.gserviceaccount.com/roles/iam.serviceAccountUser/serviceaccount:295454028483@cloudbuild.gserviceaccount.com]
module.en.google_secret_manager_secret.csrf-token: Refreshing state... [id=projects/cw-en-verification-9/secrets/csrf-token]
module.en.google_firebase_web_app.default: Refreshing state... [id=projects/cw-en-verification-9/webApps/1:295454028483:web:1b7975c50d53469d016876]
module.en.google_secret_manager_secret_iam_member.cleanup-db["sslkey"]: Refreshing state... [id=projects/cw-en-verification-9/secrets/db-sslkey/roles/secretmanager.secretAccessor/serviceaccount:en-verification-cleanup-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.cleanup-db["password"]: Refreshing state... [id=projects/cw-en-verification-9/secrets/db-password/roles/secretmanager.secretAccessor/serviceaccount:en-verification-cleanup-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.cleanup-db["sslcert"]: Refreshing state... [id=projects/cw-en-verification-9/secrets/db-sslcert/roles/secretmanager.secretAccessor/serviceaccount:en-verification-cleanup-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.cleanup-db["sslrootcert"]: Refreshing state... [id=projects/cw-en-verification-9/secrets/db-sslrootcert/roles/secretmanager.secretAccessor/serviceaccount:en-verification-cleanup-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.adminapi-db["sslkey"]: Refreshing state... [id=projects/cw-en-verification-9/secrets/db-sslkey/roles/secretmanager.secretAccessor/serviceaccount:en-verification-adminapi-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.adminapi-db["password"]: Refreshing state... [id=projects/cw-en-verification-9/secrets/db-password/roles/secretmanager.secretAccessor/serviceaccount:en-verification-adminapi-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.adminapi-db["sslrootcert"]: Refreshing state... [id=projects/cw-en-verification-9/secrets/db-sslrootcert/roles/secretmanager.secretAccessor/serviceaccount:en-verification-adminapi-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.adminapi-db["sslcert"]: Refreshing state... [id=projects/cw-en-verification-9/secrets/db-sslcert/roles/secretmanager.secretAccessor/serviceaccount:en-verification-adminapi-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.e2e-runner-db["password"]: Refreshing state... [id=projects/cw-en-verification-9/secrets/db-password/roles/secretmanager.secretAccessor/serviceaccount:en-verification-e2e-runner-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.e2e-runner-db["sslrootcert"]: Refreshing state... [id=projects/cw-en-verification-9/secrets/db-sslrootcert/roles/secretmanager.secretAccessor/serviceaccount:en-verification-e2e-runner-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.e2e-runner-db["sslcert"]: Refreshing state... [id=projects/cw-en-verification-9/secrets/db-sslcert/roles/secretmanager.secretAccessor/serviceaccount:en-verification-e2e-runner-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.e2e-runner-db["sslkey"]: Refreshing state... [id=projects/cw-en-verification-9/secrets/db-sslkey/roles/secretmanager.secretAccessor/serviceaccount:en-verification-e2e-runner-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.server-db["sslcert"]: Refreshing state... [id=projects/cw-en-verification-9/secrets/db-sslcert/roles/secretmanager.secretAccessor/serviceaccount:en-verification-server-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.server-db["sslrootcert"]: Refreshing state... [id=projects/cw-en-verification-9/secrets/db-sslrootcert/roles/secretmanager.secretAccessor/serviceaccount:en-verification-server-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.server-db["password"]: Refreshing state... [id=projects/cw-en-verification-9/secrets/db-password/roles/secretmanager.secretAccessor/serviceaccount:en-verification-server-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.server-db["sslkey"]: Refreshing state... [id=projects/cw-en-verification-9/secrets/db-sslkey/roles/secretmanager.secretAccessor/serviceaccount:en-verification-server-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.apiserver-db["sslcert"]: Refreshing state... [id=projects/cw-en-verification-9/secrets/db-sslcert/roles/secretmanager.secretAccessor/serviceaccount:en-verification-apiserver-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.apiserver-db["sslrootcert"]: Refreshing state... [id=projects/cw-en-verification-9/secrets/db-sslrootcert/roles/secretmanager.secretAccessor/serviceaccount:en-verification-apiserver-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.apiserver-db["password"]: Refreshing state... [id=projects/cw-en-verification-9/secrets/db-password/roles/secretmanager.secretAccessor/serviceaccount:en-verification-apiserver-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.apiserver-db["sslkey"]: Refreshing state... [id=projects/cw-en-verification-9/secrets/db-sslkey/roles/secretmanager.secretAccessor/serviceaccount:en-verification-apiserver-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.cloudbuild-db-pwd: Refreshing state... [id=projects/cw-en-verification-9/secrets/db-password/roles/secretmanager.secretAccessor/serviceaccount:295454028483@cloudbuild.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.e2e-runner-db-apikey-db-hmac: Refreshing state... [id=projects/cw-en-verification-9/secrets/db-apikey-db-hmac/roles/secretmanager.secretAccessor/serviceaccount:en-verification-e2e-runner-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.cleanup-db-apikey-db-hmac: Refreshing state... [id=projects/cw-en-verification-9/secrets/db-apikey-db-hmac/roles/secretmanager.secretAccessor/serviceaccount:en-verification-cleanup-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.apiserver-db-apikey-db-hmac: Refreshing state... [id=projects/cw-en-verification-9/secrets/db-apikey-db-hmac/roles/secretmanager.secretAccessor/serviceaccount:en-verification-apiserver-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.server-db-apikey-db-hmac: Refreshing state... [id=projects/cw-en-verification-9/secrets/db-apikey-db-hmac/roles/secretmanager.secretAccessor/serviceaccount:en-verification-server-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.adminapi-db-apikey-db-hmac: Refreshing state... [id=projects/cw-en-verification-9/secrets/db-apikey-db-hmac/roles/secretmanager.secretAccessor/serviceaccount:en-verification-adminapi-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.cloudbuild-db-apikey-db-hmac: Refreshing state... [id=projects/cw-en-verification-9/secrets/db-apikey-db-hmac/roles/secretmanager.secretAccessor/serviceaccount:295454028483@cloudbuild.gserviceaccount.com]
module.en.google_secret_manager_secret_version.db-apikey-db-hmac: Refreshing state... [id=projects/295454028483/secrets/db-apikey-db-hmac/versions/1]
module.en.google_secret_manager_secret_version.db-apikey-sig-hmac: Refreshing state... [id=projects/295454028483/secrets/db-apikey-sig-hmac/versions/1]
module.en.google_secret_manager_secret_iam_member.cloudbuild-db-apikey-sig-hmac: Refreshing state... [id=projects/cw-en-verification-9/secrets/db-apikey-sig-hmac/roles/secretmanager.secretAccessor/serviceaccount:295454028483@cloudbuild.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.server-db-apikey-sig-hmac: Refreshing state... [id=projects/cw-en-verification-9/secrets/db-apikey-sig-hmac/roles/secretmanager.secretAccessor/serviceaccount:en-verification-server-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.apiserver-db-apikey-sig-hmac: Refreshing state... [id=projects/cw-en-verification-9/secrets/db-apikey-sig-hmac/roles/secretmanager.secretAccessor/serviceaccount:en-verification-apiserver-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.e2e-runner-db-apikey-sig-hmac: Refreshing state... [id=projects/cw-en-verification-9/secrets/db-apikey-sig-hmac/roles/secretmanager.secretAccessor/serviceaccount:en-verification-e2e-runner-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.adminapi-db-apikey-sig-hmac: Refreshing state... [id=projects/cw-en-verification-9/secrets/db-apikey-sig-hmac/roles/secretmanager.secretAccessor/serviceaccount:en-verification-adminapi-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.cleanup-db-apikey-sig-hmac: Refreshing state... [id=projects/cw-en-verification-9/secrets/db-apikey-sig-hmac/roles/secretmanager.secretAccessor/serviceaccount:en-verification-cleanup-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_storage_bucket_iam_member.cloudbuild-cache: Refreshing state... [id=b/cw-en-verification-9-cloudbuild-cache/roles/storage.objectAdmin/serviceaccount:295454028483@cloudbuild.gserviceaccount.com]
module.en.google_secret_manager_secret_version.cache-hmac-key: Refreshing state... [id=projects/295454028483/secrets/cache-hmac-key/versions/1]
module.en.google_secret_manager_secret_iam_member.server-cookie-encryption-key: Refreshing state... [id=projects/cw-en-verification-9/secrets/cookie-encryption-key/roles/secretmanager.secretAccessor/serviceaccount:en-verification-server-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_version.cookie-encryption-key-version: Refreshing state... [id=projects/295454028483/secrets/cookie-encryption-key/versions/1]
module.en.google_secret_manager_secret_version.db-verification-code-hmac: Refreshing state... [id=projects/295454028483/secrets/db-verification-code-hmac/versions/1]
module.en.google_secret_manager_secret_iam_member.cleanup-db-verification-code-hmac: Refreshing state... [id=projects/cw-en-verification-9/secrets/db-verification-code-hmac/roles/secretmanager.secretAccessor/serviceaccount:en-verification-cleanup-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.e2e-runner-db-verification-code-hmac: Refreshing state... [id=projects/cw-en-verification-9/secrets/db-verification-code-hmac/roles/secretmanager.secretAccessor/serviceaccount:en-verification-e2e-runner-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.server-db-verification-code-hmac: Refreshing state... [id=projects/cw-en-verification-9/secrets/db-verification-code-hmac/roles/secretmanager.secretAccessor/serviceaccount:en-verification-server-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.adminapi-db-verification-code-hmac: Refreshing state... [id=projects/cw-en-verification-9/secrets/db-verification-code-hmac/roles/secretmanager.secretAccessor/serviceaccount:en-verification-adminapi-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.apiserver-db-verification-code-hmac: Refreshing state... [id=projects/cw-en-verification-9/secrets/db-verification-code-hmac/roles/secretmanager.secretAccessor/serviceaccount:en-verification-apiserver-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.cloudbuild-db-verification-code-hmac: Refreshing state... [id=projects/cw-en-verification-9/secrets/db-verification-code-hmac/roles/secretmanager.secretAccessor/serviceaccount:295454028483@cloudbuild.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.server-cookie-hmac-key: Refreshing state... [id=projects/cw-en-verification-9/secrets/cookie-hmac-key/roles/secretmanager.secretAccessor/serviceaccount:en-verification-server-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_version.cookie-hmac-key-version: Refreshing state... [id=projects/295454028483/secrets/cookie-hmac-key/versions/1]
module.en.google_service_networking_connection.private_vpc_connection: Refreshing state... [id=projects%2Fcw-en-verification-9%2Fglobal%2Fnetworks%2Fdefault:servicenetworking.googleapis.com]
module.en.google_kms_key_ring_iam_member.kms-signerverifier: Refreshing state... [id=projects/cw-en-verification-9/locations/us-central1/keyRings/verification/roles/cloudkms.signerVerifier/serviceaccount:en-verification-apiserver-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_kms_crypto_key.database-encrypter: Refreshing state... [id=projects/cw-en-verification-9/locations/us-central1/keyRings/verification/cryptoKeys/database-encrypter]
module.en.google_kms_crypto_key.token-signer: Refreshing state... [id=projects/cw-en-verification-9/locations/us-central1/keyRings/verification/cryptoKeys/token-signer]
module.en.google_kms_key_ring_iam_member.server-verification-key-admin: Refreshing state... [id=projects/cw-en-verification-9/locations/us-central1/keyRings/verification/roles/cloudkms.admin/serviceaccount:en-verification-server-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_kms_crypto_key.certificate-signer: Refreshing state... [id=projects/cw-en-verification-9/locations/us-central1/keyRings/verification/cryptoKeys/certificate-signer]
module.en.google_kms_key_ring_iam_member.server-verification-key-signer-verifier: Refreshing state... [id=projects/cw-en-verification-9/locations/us-central1/keyRings/verification/roles/cloudkms.signerVerifier/serviceaccount:en-verification-server-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.server-csrf: Refreshing state... [id=projects/cw-en-verification-9/secrets/csrf-token/roles/secretmanager.secretAccessor/serviceaccount:en-verification-server-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_version.csrf-token-version: Refreshing state... [id=projects/295454028483/secrets/csrf-token/versions/1]
module.en.data.google_firebase_web_app_config.default: Refreshing state... [id=1:295454028483:web:1b7975c50d53469d016876]
module.en.null_resource.build: Refreshing state... [id=5831617806159934577]
module.en.data.google_kms_crypto_key_version.token-signer-version: Refreshing state... [id=//cloudkms.googleapis.com/v1/projects/cw-en-verification-9/locations/us-central1/keyRings/verification/cryptoKeys/token-signer/cryptoKeyVersions/1]
module.en.google_kms_crypto_key_iam_member.e2e-runner-database-encrypter: Refreshing state... [id=projects/cw-en-verification-9/locations/us-central1/keyRings/verification/cryptoKeys/database-encrypter/roles/cloudkms.cryptoKeyEncrypterDecrypter/serviceaccount:en-verification-e2e-runner-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_kms_crypto_key_iam_member.adminapi-database-encrypter: Refreshing state... [id=projects/cw-en-verification-9/locations/us-central1/keyRings/verification/cryptoKeys/database-encrypter/roles/cloudkms.cryptoKeyEncrypterDecrypter/serviceaccount:en-verification-adminapi-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_kms_crypto_key_iam_member.cleanup-database-encrypter: Refreshing state... [id=projects/cw-en-verification-9/locations/us-central1/keyRings/verification/cryptoKeys/database-encrypter/roles/cloudkms.cryptoKeyEncrypterDecrypter/serviceaccount:en-verification-cleanup-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_kms_crypto_key_iam_member.server-database-encrypter: Refreshing state... [id=projects/cw-en-verification-9/locations/us-central1/keyRings/verification/cryptoKeys/database-encrypter/roles/cloudkms.cryptoKeyEncrypterDecrypter/serviceaccount:en-verification-server-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_kms_crypto_key_iam_member.apiserver-database-encrypter: Refreshing state... [id=projects/cw-en-verification-9/locations/us-central1/keyRings/verification/cryptoKeys/database-encrypter/roles/cloudkms.cryptoKeyEncrypterDecrypter/serviceaccount:en-verification-apiserver-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_kms_crypto_key_iam_member.database-database-encrypter: Refreshing state... [id=projects/cw-en-verification-9/locations/us-central1/keyRings/verification/cryptoKeys/database-encrypter/roles/cloudkms.cryptoKeyEncrypterDecrypter/serviceaccount:295454028483@cloudbuild.gserviceaccount.com]
module.en.data.google_kms_crypto_key_version.certificate-signer-version: Refreshing state... [id=//cloudkms.googleapis.com/v1/projects/cw-en-verification-9/locations/us-central1/keyRings/verification/cryptoKeys/certificate-signer/cryptoKeyVersions/1]
module.en.google_redis_instance.cache: Refreshing state... [id=projects/cw-en-verification-9/locations/us-central1/instances/verification-cache]
module.en.google_sql_database_instance.db-inst: Refreshing state... [id=en-verification]
module.en.google_sql_user.user: Refreshing state... [id=verification//en-verification]
module.en.google_sql_database.db: Refreshing state... [id=projects/cw-en-verification-9/instances/en-verification/databases/verification]
module.en.google_sql_ssl_cert.db-cert: Refreshing state... [id=projects/cw-en-verification-9/instances/en-verification/sslCerts/0b52aefe01a28469d412de89b68aaa59d36a2f37]
module.en.google_secret_manager_secret_version.db-secret-version["sslcert"]: Refreshing state... [id=projects/295454028483/secrets/db-sslcert/versions/1]
module.en.google_secret_manager_secret_version.db-secret-version["password"]: Refreshing state... [id=projects/295454028483/secrets/db-password/versions/1]
module.en.google_secret_manager_secret_version.db-secret-version["sslkey"]: Refreshing state... [id=projects/295454028483/secrets/db-sslkey/versions/1]
module.en.google_secret_manager_secret_version.db-secret-version["sslrootcert"]: Refreshing state... [id=projects/295454028483/secrets/db-sslrootcert/versions/1]
module.en.null_resource.migrate: Refreshing state... [id=7376094188326433111]
module.en.local_file.env[0]: Refreshing state... [id=757fcb2e0a9712052118988f93ec4490fbaadf99]
module.en.google_cloud_run_service.adminapi: Refreshing state... [id=locations/us-central1/namespaces/cw-en-verification-9/services/adminapi]
module.en.google_cloud_run_service.apiserver: Refreshing state... [id=locations/us-central1/namespaces/cw-en-verification-9/services/apiserver]
module.en.google_cloud_run_service.server: Refreshing state... [id=locations/us-central1/namespaces/cw-en-verification-9/services/server]
module.en.google_cloud_run_service.cleanup: Refreshing state... [id=locations/us-central1/namespaces/cw-en-verification-9/services/cleanup]
module.en.google_cloud_run_service_iam_member.cleanup-invoker: Refreshing state... [id=v1/projects/cw-en-verification-9/locations/us-central1/services/cleanup/roles/run.invoker/serviceaccount:en-cleanup-invoker-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_cloud_scheduler_job.cleanup-worker: Refreshing state... [id=projects/cw-en-verification-9/locations/us-central1/jobs/cleanup-worker]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.en.google_cloud_run_service.adminapi will be created
  + resource "google_cloud_run_service" "adminapi" {
      + autogenerate_revision_name = true
      + id                         = (known after apply)
      + location                   = "us-central1"
      + name                       = "adminapi"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + labels           = (known after apply)
          + namespace        = (known after apply)
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + template {
          + metadata {
              + annotations      = {
                  + "run.googleapis.com/vpc-access-connector" = "projects/cw-en-verification-9/locations/us-central1/connectors/serverless-vpc-connector"
                }
              + generation       = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }

          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = "en-verification-adminapi-sa@cw-en-verification-9.iam.gserviceaccount.com"
              + serving_state         = (known after apply)
              + timeout_seconds       = 25

              + containers {
                  + image = "gcr.io/cw-en-verification-9/github.com/google/exposure-notifications-verification-server/adminapi:initial"

                  + env {
                      + name  = "CACHE_HMAC_KEY"
                      + value = "secret://projects/295454028483/secrets/cache-hmac-key/versions/1"
                    }
                  + env {
                      + name  = "CACHE_REDIS_HOST"
                      + value = "10.123.1.4"
                    }
                  + env {
                      + name  = "CACHE_REDIS_PORT"
                      + value = "6379"
                    }
                  + env {
                      + name  = "CACHE_TYPE"
                      + value = "REDIS"
                    }
                  + env {
                      + name  = "DB_APIKEY_DATABASE_KEY"
                      + value = "secret://projects/295454028483/secrets/db-apikey-db-hmac/versions/1"
                    }
                  + env {
                      + name  = "DB_APIKEY_SIGNATURE_KEY"
                      + value = "secret://projects/295454028483/secrets/db-apikey-sig-hmac/versions/1"
                    }
                  + env {
                      + name  = "DB_ENCRYPTION_KEY"
                      + value = "projects/cw-en-verification-9/locations/us-central1/keyRings/verification/cryptoKeys/database-encrypter"
                    }
                  + env {
                      + name  = "DB_HOST"
                      + value = "10.123.0.2"
                    }
                  + env {
                      + name  = "DB_KEY_MANAGER"
                      + value = "GOOGLE_CLOUD_KMS"
                    }
                  + env {
                      + name  = "DB_NAME"
                      + value = "verification"
                    }
                  + env {
                      + name  = "DB_PASSWORD"
                      + value = "secret://projects/295454028483/secrets/db-password/versions/1"
                    }
                  + env {
                      + name  = "DB_SSLCERT"
                      + value = "secret://projects/295454028483/secrets/db-sslcert/versions/1?target=file"
                    }
                  + env {
                      + name  = "DB_SSLKEY"
                      + value = "secret://projects/295454028483/secrets/db-sslkey/versions/1?target=file"
                    }
                  + env {
                      + name  = "DB_SSLMODE"
                      + value = "verify-ca"
                    }
                  + env {
                      + name  = "DB_SSLROOTCERT"
                      + value = "secret://projects/295454028483/secrets/db-sslrootcert/versions/1?target=file"
                    }
                  + env {
                      + name  = "DB_USER"
                      + value = "verification"
                    }
                  + env {
                      + name  = "DB_VERIFICATION_CODE_DATABASE_KEY"
                      + value = "secret://projects/295454028483/secrets/db-verification-code-hmac/versions/1"
                    }
                  + env {
                      + name  = "PROJECT_ID"
                      + value = "cw-en-verification-9"
                    }
                  + env {
                      + name  = "RATE_LIMIT_INTERVAL"
                      + value = "1m"
                    }
                  + env {
                      + name  = "RATE_LIMIT_REDIS_HOST"
                      + value = "10.123.1.4"
                    }
                  + env {
                      + name  = "RATE_LIMIT_REDIS_PORT"
                      + value = "6379"
                    }
                  + env {
                      + name  = "RATE_LIMIT_TOKENS"
                      + value = "60"
                    }
                  + env {
                      + name  = "RATE_LIMIT_TYPE"
                      + value = "REDIS"
                    }

                  + ports {
                      + container_port = (known after apply)
                      + name           = (known after apply)
                      + protocol       = (known after apply)
                    }

                  + resources {
                      + limits = {
                          + "cpu"    = "1"
                          + "memory" = "512Mi"
                        }
                    }
                }
            }
        }

      + traffic {
          + latest_revision = (known after apply)
          + percent         = (known after apply)
          + revision_name   = (known after apply)
        }
    }

  # module.en.google_cloud_run_service.apiserver will be created
  + resource "google_cloud_run_service" "apiserver" {
      + autogenerate_revision_name = true
      + id                         = (known after apply)
      + location                   = "us-central1"
      + name                       = "apiserver"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + labels           = (known after apply)
          + namespace        = (known after apply)
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + template {
          + metadata {
              + annotations      = {
                  + "run.googleapis.com/vpc-access-connector" = "projects/cw-en-verification-9/locations/us-central1/connectors/serverless-vpc-connector"
                }
              + generation       = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }

          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = "en-verification-apiserver-sa@cw-en-verification-9.iam.gserviceaccount.com"
              + serving_state         = (known after apply)
              + timeout_seconds       = 25

              + containers {
                  + image = "gcr.io/cw-en-verification-9/github.com/google/exposure-notifications-verification-server/apiserver:initial"

                  + env {
                      + name  = "CACHE_HMAC_KEY"
                      + value = "secret://projects/295454028483/secrets/cache-hmac-key/versions/1"
                    }
                  + env {
                      + name  = "CACHE_REDIS_HOST"
                      + value = "10.123.1.4"
                    }
                  + env {
                      + name  = "CACHE_REDIS_PORT"
                      + value = "6379"
                    }
                  + env {
                      + name  = "CACHE_TYPE"
                      + value = "REDIS"
                    }
                  + env {
                      + name  = "CERTIFICATE_KEY_MANAGER"
                      + value = "GOOGLE_CLOUD_KMS"
                    }
                  + env {
                      + name  = "CERTIFICATE_SIGNING_KEY"
                      + value = "projects/cw-en-verification-9/locations/us-central1/keyRings/verification/cryptoKeys/certificate-signer/cryptoKeyVersions/1"
                    }
                  + env {
                      + name  = "CERTIFICATE_SIGNING_KEYRING"
                      + value = "projects/cw-en-verification-9/locations/us-central1/keyRings/verification"
                    }
                  + env {
                      + name  = "CSRF_AUTH_KEY"
                      + value = "secret://projects/295454028483/secrets/csrf-token/versions/1"
                    }
                  + env {
                      + name  = "DB_APIKEY_DATABASE_KEY"
                      + value = "secret://projects/295454028483/secrets/db-apikey-db-hmac/versions/1"
                    }
                  + env {
                      + name  = "DB_APIKEY_SIGNATURE_KEY"
                      + value = "secret://projects/295454028483/secrets/db-apikey-sig-hmac/versions/1"
                    }
                  + env {
                      + name  = "DB_ENCRYPTION_KEY"
                      + value = "projects/cw-en-verification-9/locations/us-central1/keyRings/verification/cryptoKeys/database-encrypter"
                    }
                  + env {
                      + name  = "DB_HOST"
                      + value = "10.123.0.2"
                    }
                  + env {
                      + name  = "DB_KEY_MANAGER"
                      + value = "GOOGLE_CLOUD_KMS"
                    }
                  + env {
                      + name  = "DB_NAME"
                      + value = "verification"
                    }
                  + env {
                      + name  = "DB_PASSWORD"
                      + value = "secret://projects/295454028483/secrets/db-password/versions/1"
                    }
                  + env {
                      + name  = "DB_SSLCERT"
                      + value = "secret://projects/295454028483/secrets/db-sslcert/versions/1?target=file"
                    }
                  + env {
                      + name  = "DB_SSLKEY"
                      + value = "secret://projects/295454028483/secrets/db-sslkey/versions/1?target=file"
                    }
                  + env {
                      + name  = "DB_SSLMODE"
                      + value = "verify-ca"
                    }
                  + env {
                      + name  = "DB_SSLROOTCERT"
                      + value = "secret://projects/295454028483/secrets/db-sslrootcert/versions/1?target=file"
                    }
                  + env {
                      + name  = "DB_USER"
                      + value = "verification"
                    }
                  + env {
                      + name  = "DB_VERIFICATION_CODE_DATABASE_KEY"
                      + value = "secret://projects/295454028483/secrets/db-verification-code-hmac/versions/1"
                    }
                  + env {
                      + name  = "FIREBASE_API_KEY"
                      + value = "AIzaSyB43Grz7xgOucC99JKprmDVHhNvrol-NlI"
                    }
                  + env {
                      + name  = "FIREBASE_APP_ID"
                      + value = "1:295454028483:web:1b7975c50d53469d016876"
                    }
                  + env {
                      + name  = "FIREBASE_AUTH_DOMAIN"
                      + value = "cw-en-verification-9.firebaseapp.com"
                    }
                  + env {
                      + name  = "FIREBASE_DATABASE_URL"
                      + value = "https://cw-en-verification-9.firebaseio.com"
                    }
                  + env {
                      + name = "FIREBASE_MEASUREMENT_ID"
                    }
                  + env {
                      + name  = "FIREBASE_MESSAGE_SENDER_ID"
                      + value = "295454028483"
                    }
                  + env {
                      + name  = "FIREBASE_PROJECT_ID"
                      + value = "cw-en-verification-9"
                    }
                  + env {
                      + name  = "FIREBASE_STORAGE_BUCKET"
                      + value = "cw-en-verification-9.appspot.com"
                    }
                  + env {
                      + name  = "PROJECT_ID"
                      + value = "cw-en-verification-9"
                    }
                  + env {
                      + name  = "RATE_LIMIT_INTERVAL"
                      + value = "1m"
                    }
                  + env {
                      + name  = "RATE_LIMIT_REDIS_HOST"
                      + value = "10.123.1.4"
                    }
                  + env {
                      + name  = "RATE_LIMIT_REDIS_PORT"
                      + value = "6379"
                    }
                  + env {
                      + name  = "RATE_LIMIT_TOKENS"
                      + value = "60"
                    }
                  + env {
                      + name  = "RATE_LIMIT_TYPE"
                      + value = "REDIS"
                    }
                  + env {
                      + name  = "TOKEN_KEY_MANAGER"
                      + value = "GOOGLE_CLOUD_KMS"
                    }
                  + env {
                      + name  = "TOKEN_SIGNING_KEY"
                      + value = "projects/cw-en-verification-9/locations/us-central1/keyRings/verification/cryptoKeys/token-signer/cryptoKeyVersions/1"
                    }

                  + ports {
                      + container_port = (known after apply)
                      + name           = (known after apply)
                      + protocol       = (known after apply)
                    }

                  + resources {
                      + limits = {
                          + "cpu"    = "1"
                          + "memory" = "512Mi"
                        }
                    }
                }
            }
        }

      + traffic {
          + latest_revision = (known after apply)
          + percent         = (known after apply)
          + revision_name   = (known after apply)
        }
    }

  # module.en.google_cloud_run_service.e2e-runner will be created
  + resource "google_cloud_run_service" "e2e-runner" {
      + autogenerate_revision_name = true
      + id                         = (known after apply)
      + location                   = "us-central1"
      + name                       = "e2e-runner"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + labels           = (known after apply)
          + namespace        = (known after apply)
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + template {
          + metadata {
              + annotations      = {
                  + "run.googleapis.com/vpc-access-connector" = "projects/cw-en-verification-9/locations/us-central1/connectors/serverless-vpc-connector"
                }
              + generation       = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }

          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = "en-verification-e2e-runner-sa@cw-en-verification-9.iam.gserviceaccount.com"
              + serving_state         = (known after apply)
              + timeout_seconds       = (known after apply)

              + containers {
                  + image = "gcr.io/cw-en-verification-9/github.com/google/exposure-notifications-verification-server/e2e-runner:initial"

                  + env {
                      + name  = "CACHE_HMAC_KEY"
                      + value = "secret://projects/295454028483/secrets/cache-hmac-key/versions/1"
                    }
                  + env {
                      + name  = "CACHE_REDIS_HOST"
                      + value = "10.123.1.4"
                    }
                  + env {
                      + name  = "CACHE_REDIS_PORT"
                      + value = "6379"
                    }
                  + env {
                      + name  = "CACHE_TYPE"
                      + value = "REDIS"
                    }
                  + env {
                      + name  = "CERTIFICATE_KEY_MANAGER"
                      + value = "GOOGLE_CLOUD_KMS"
                    }
                  + env {
                      + name  = "CERTIFICATE_SIGNING_KEY"
                      + value = "projects/cw-en-verification-9/locations/us-central1/keyRings/verification/cryptoKeys/certificate-signer/cryptoKeyVersions/1"
                    }
                  + env {
                      + name  = "CERTIFICATE_SIGNING_KEYRING"
                      + value = "projects/cw-en-verification-9/locations/us-central1/keyRings/verification"
                    }
                  + env {
                      + name  = "CSRF_AUTH_KEY"
                      + value = "secret://projects/295454028483/secrets/csrf-token/versions/1"
                    }
                  + env {
                      + name  = "DB_APIKEY_DATABASE_KEY"
                      + value = "secret://projects/295454028483/secrets/db-apikey-db-hmac/versions/1"
                    }
                  + env {
                      + name  = "DB_APIKEY_SIGNATURE_KEY"
                      + value = "secret://projects/295454028483/secrets/db-apikey-sig-hmac/versions/1"
                    }
                  + env {
                      + name  = "DB_ENCRYPTION_KEY"
                      + value = "projects/cw-en-verification-9/locations/us-central1/keyRings/verification/cryptoKeys/database-encrypter"
                    }
                  + env {
                      + name  = "DB_HOST"
                      + value = "10.123.0.2"
                    }
                  + env {
                      + name  = "DB_KEY_MANAGER"
                      + value = "GOOGLE_CLOUD_KMS"
                    }
                  + env {
                      + name  = "DB_NAME"
                      + value = "verification"
                    }
                  + env {
                      + name  = "DB_PASSWORD"
                      + value = "secret://projects/295454028483/secrets/db-password/versions/1"
                    }
                  + env {
                      + name  = "DB_SSLCERT"
                      + value = "secret://projects/295454028483/secrets/db-sslcert/versions/1?target=file"
                    }
                  + env {
                      + name  = "DB_SSLKEY"
                      + value = "secret://projects/295454028483/secrets/db-sslkey/versions/1?target=file"
                    }
                  + env {
                      + name  = "DB_SSLMODE"
                      + value = "verify-ca"
                    }
                  + env {
                      + name  = "DB_SSLROOTCERT"
                      + value = "secret://projects/295454028483/secrets/db-sslrootcert/versions/1?target=file"
                    }
                  + env {
                      + name  = "DB_USER"
                      + value = "verification"
                    }
                  + env {
                      + name  = "DB_VERIFICATION_CODE_DATABASE_KEY"
                      + value = "secret://projects/295454028483/secrets/db-verification-code-hmac/versions/1"
                    }
                  + env {
                      + name  = "FIREBASE_API_KEY"
                      + value = "AIzaSyB43Grz7xgOucC99JKprmDVHhNvrol-NlI"
                    }
                  + env {
                      + name  = "FIREBASE_APP_ID"
                      + value = "1:295454028483:web:1b7975c50d53469d016876"
                    }
                  + env {
                      + name  = "FIREBASE_AUTH_DOMAIN"
                      + value = "cw-en-verification-9.firebaseapp.com"
                    }
                  + env {
                      + name  = "FIREBASE_DATABASE_URL"
                      + value = "https://cw-en-verification-9.firebaseio.com"
                    }
                  + env {
                      + name = "FIREBASE_MEASUREMENT_ID"
                    }
                  + env {
                      + name  = "FIREBASE_MESSAGE_SENDER_ID"
                      + value = "295454028483"
                    }
                  + env {
                      + name  = "FIREBASE_PROJECT_ID"
                      + value = "cw-en-verification-9"
                    }
                  + env {
                      + name  = "FIREBASE_STORAGE_BUCKET"
                      + value = "cw-en-verification-9.appspot.com"
                    }
                  + env {
                      + name  = "HEALTH_AUTHORITY_CODE"
                      + value = "com.example"
                    }
                  + env {
                      + name  = "KEY_SERVER"
                      + value = "https://example.com/v1/publish"
                    }
                  + env {
                      + name  = "PROJECT_ID"
                      + value = "cw-en-verification-9"
                    }
                  + env {
                      + name  = "TOKEN_KEY_MANAGER"
                      + value = "GOOGLE_CLOUD_KMS"
                    }
                  + env {
                      + name  = "TOKEN_SIGNING_KEY"
                      + value = "projects/cw-en-verification-9/locations/us-central1/keyRings/verification/cryptoKeys/token-signer/cryptoKeyVersions/1"
                    }
                  + env {
                      + name  = "VERIFICATION_ADMIN_API"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "VERIFICATION_SERVER_API"
                      + value = (known after apply)
                    }

                  + ports {
                      + container_port = (known after apply)
                      + name           = (known after apply)
                      + protocol       = (known after apply)
                    }

                  + resources {
                      + limits = {
                          + "cpu"    = "1"
                          + "memory" = "512Mi"
                        }
                    }
                }
            }
        }

      + traffic {
          + latest_revision = (known after apply)
          + percent         = (known after apply)
          + revision_name   = (known after apply)
        }
    }

  # module.en.google_cloud_run_service.server will be created
  + resource "google_cloud_run_service" "server" {
      + autogenerate_revision_name = true
      + id                         = (known after apply)
      + location                   = "us-central1"
      + name                       = "server"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + labels           = (known after apply)
          + namespace        = (known after apply)
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + template {
          + metadata {
              + annotations      = {
                  + "run.googleapis.com/vpc-access-connector" = "projects/cw-en-verification-9/locations/us-central1/connectors/serverless-vpc-connector"
                }
              + generation       = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }

          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = "en-verification-server-sa@cw-en-verification-9.iam.gserviceaccount.com"
              + serving_state         = (known after apply)
              + timeout_seconds       = 25

              + containers {
                  + image = "gcr.io/cw-en-verification-9/github.com/google/exposure-notifications-verification-server/server:initial"

                  + env {
                      + name  = "ASSETS_PATH"
                      + value = "/assets"
                    }
                  + env {
                      + name  = "CACHE_HMAC_KEY"
                      + value = "secret://projects/295454028483/secrets/cache-hmac-key/versions/1"
                    }
                  + env {
                      + name  = "CACHE_REDIS_HOST"
                      + value = "10.123.1.4"
                    }
                  + env {
                      + name  = "CACHE_REDIS_PORT"
                      + value = "6379"
                    }
                  + env {
                      + name  = "CACHE_TYPE"
                      + value = "REDIS"
                    }
                  + env {
                      + name  = "CERTIFICATE_KEY_MANAGER"
                      + value = "GOOGLE_CLOUD_KMS"
                    }
                  + env {
                      + name  = "CERTIFICATE_SIGNING_KEY"
                      + value = "projects/cw-en-verification-9/locations/us-central1/keyRings/verification/cryptoKeys/certificate-signer/cryptoKeyVersions/1"
                    }
                  + env {
                      + name  = "CERTIFICATE_SIGNING_KEYRING"
                      + value = "projects/cw-en-verification-9/locations/us-central1/keyRings/verification"
                    }
                  + env {
                      + name  = "COOKIE_KEYS"
                      + value = "secret://projects/295454028483/secrets/cookie-hmac-key/versions/1,secret://projects/295454028483/secrets/cookie-encryption-key/versions/1"
                    }
                  + env {
                      + name  = "CSRF_AUTH_KEY"
                      + value = "secret://projects/295454028483/secrets/csrf-token/versions/1"
                    }
                  + env {
                      + name  = "DB_APIKEY_DATABASE_KEY"
                      + value = "secret://projects/295454028483/secrets/db-apikey-db-hmac/versions/1"
                    }
                  + env {
                      + name  = "DB_APIKEY_SIGNATURE_KEY"
                      + value = "secret://projects/295454028483/secrets/db-apikey-sig-hmac/versions/1"
                    }
                  + env {
                      + name  = "DB_ENCRYPTION_KEY"
                      + value = "projects/cw-en-verification-9/locations/us-central1/keyRings/verification/cryptoKeys/database-encrypter"
                    }
                  + env {
                      + name  = "DB_HOST"
                      + value = "10.123.0.2"
                    }
                  + env {
                      + name  = "DB_KEY_MANAGER"
                      + value = "GOOGLE_CLOUD_KMS"
                    }
                  + env {
                      + name  = "DB_NAME"
                      + value = "verification"
                    }
                  + env {
                      + name  = "DB_PASSWORD"
                      + value = "secret://projects/295454028483/secrets/db-password/versions/1"
                    }
                  + env {
                      + name  = "DB_SSLCERT"
                      + value = "secret://projects/295454028483/secrets/db-sslcert/versions/1?target=file"
                    }
                  + env {
                      + name  = "DB_SSLKEY"
                      + value = "secret://projects/295454028483/secrets/db-sslkey/versions/1?target=file"
                    }
                  + env {
                      + name  = "DB_SSLMODE"
                      + value = "verify-ca"
                    }
                  + env {
                      + name  = "DB_SSLROOTCERT"
                      + value = "secret://projects/295454028483/secrets/db-sslrootcert/versions/1?target=file"
                    }
                  + env {
                      + name  = "DB_USER"
                      + value = "verification"
                    }
                  + env {
                      + name  = "DB_VERIFICATION_CODE_DATABASE_KEY"
                      + value = "secret://projects/295454028483/secrets/db-verification-code-hmac/versions/1"
                    }
                  + env {
                      + name  = "FIREBASE_API_KEY"
                      + value = "AIzaSyB43Grz7xgOucC99JKprmDVHhNvrol-NlI"
                    }
                  + env {
                      + name  = "FIREBASE_APP_ID"
                      + value = "1:295454028483:web:1b7975c50d53469d016876"
                    }
                  + env {
                      + name  = "FIREBASE_AUTH_DOMAIN"
                      + value = "cw-en-verification-9.firebaseapp.com"
                    }
                  + env {
                      + name  = "FIREBASE_DATABASE_URL"
                      + value = "https://cw-en-verification-9.firebaseio.com"
                    }
                  + env {
                      + name = "FIREBASE_MEASUREMENT_ID"
                    }
                  + env {
                      + name  = "FIREBASE_MESSAGE_SENDER_ID"
                      + value = "295454028483"
                    }
                  + env {
                      + name  = "FIREBASE_PRIVACY_POLICY_URL"
                      + value = "https://covidwatch.org/privacy"
                    }
                  + env {
                      + name  = "FIREBASE_PROJECT_ID"
                      + value = "cw-en-verification-9"
                    }
                  + env {
                      + name  = "FIREBASE_STORAGE_BUCKET"
                      + value = "cw-en-verification-9.appspot.com"
                    }
                  + env {
                      + name  = "FIREBASE_TERMS_OF_SERVICE_URL"
                      + value = "https://covidwatch.org/terms"
                    }
                  + env {
                      + name  = "PROJECT_ID"
                      + value = "cw-en-verification-9"
                    }
                  + env {
                      + name  = "RATE_LIMIT_INTERVAL"
                      + value = "1m"
                    }
                  + env {
                      + name  = "RATE_LIMIT_REDIS_HOST"
                      + value = "10.123.1.4"
                    }
                  + env {
                      + name  = "RATE_LIMIT_REDIS_PORT"
                      + value = "6379"
                    }
                  + env {
                      + name  = "RATE_LIMIT_TOKENS"
                      + value = "60"
                    }
                  + env {
                      + name  = "RATE_LIMIT_TYPE"
                      + value = "REDIS"
                    }
                  + env {
                      + name  = "TOKEN_KEY_MANAGER"
                      + value = "GOOGLE_CLOUD_KMS"
                    }
                  + env {
                      + name  = "TOKEN_SIGNING_KEY"
                      + value = "projects/cw-en-verification-9/locations/us-central1/keyRings/verification/cryptoKeys/token-signer/cryptoKeyVersions/1"
                    }

                  + ports {
                      + container_port = (known after apply)
                      + name           = (known after apply)
                      + protocol       = (known after apply)
                    }

                  + resources {
                      + limits = {
                          + "cpu"    = "1"
                          + "memory" = "512Mi"
                        }
                    }
                }
            }
        }

      + traffic {
          + latest_revision = (known after apply)
          + percent         = (known after apply)
          + revision_name   = (known after apply)
        }
    }

  # module.en.google_cloud_run_service_iam_member.adminapi-public will be created
  + resource "google_cloud_run_service_iam_member" "adminapi-public" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "us-central1"
      + member   = "allUsers"
      + project  = (known after apply)
      + role     = "roles/run.invoker"
      + service  = "adminapi"
    }

  # module.en.google_cloud_run_service_iam_member.apiserver-public will be created
  + resource "google_cloud_run_service_iam_member" "apiserver-public" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "us-central1"
      + member   = "allUsers"
      + project  = (known after apply)
      + role     = "roles/run.invoker"
      + service  = "apiserver"
    }

  # module.en.google_cloud_run_service_iam_member.e2e-runner-invoker will be created
  + resource "google_cloud_run_service_iam_member" "e2e-runner-invoker" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "us-central1"
      + member   = "serviceAccount:en-e2e-runner-invoker-sa@cw-en-verification-9.iam.gserviceaccount.com"
      + project  = (known after apply)
      + role     = "roles/run.invoker"
      + service  = "e2e-runner"
    }

  # module.en.google_cloud_run_service_iam_member.server-public will be created
  + resource "google_cloud_run_service_iam_member" "server-public" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "us-central1"
      + member   = "allUsers"
      + project  = (known after apply)
      + role     = "roles/run.invoker"
      + service  = "server"
    }

  # module.en.google_cloud_scheduler_job.e2e-default-workflow will be created
  + resource "google_cloud_scheduler_job" "e2e-default-workflow" {
      + attempt_deadline = "600s"
      + id               = (known after apply)
      + name             = "e2e-default-workflow"
      + project          = (known after apply)
      + region           = "us-central1"
      + schedule         = "*/10 * * * *"
      + time_zone        = "America/Los_Angeles"

      + http_target {
          + http_method = "GET"
          + uri         = (known after apply)

          + oidc_token {
              + audience              = (known after apply)
              + service_account_email = "en-e2e-runner-invoker-sa@cw-en-verification-9.iam.gserviceaccount.com"
            }
        }

      + retry_config {
          + max_backoff_duration = (known after apply)
          + max_doublings        = (known after apply)
          + max_retry_duration   = (known after apply)
          + min_backoff_duration = (known after apply)
          + retry_count          = 1
        }
    }

  # module.en.google_cloud_scheduler_job.e2e-revise-workflow will be created
  + resource "google_cloud_scheduler_job" "e2e-revise-workflow" {
      + attempt_deadline = "600s"
      + id               = (known after apply)
      + name             = "e2e-revise-workflow"
      + project          = (known after apply)
      + region           = "us-central1"
      + schedule         = "*/10 * * * *"
      + time_zone        = "America/Los_Angeles"

      + http_target {
          + http_method = "GET"
          + uri         = (known after apply)

          + oidc_token {
              + audience              = (known after apply)
              + service_account_email = "en-e2e-runner-invoker-sa@cw-en-verification-9.iam.gserviceaccount.com"
            }
        }

      + retry_config {
          + max_backoff_duration = (known after apply)
          + max_doublings        = (known after apply)
          + max_retry_duration   = (known after apply)
          + min_backoff_duration = (known after apply)
          + retry_count          = 1
        }
    }

  # module.en.google_compute_region_network_endpoint_group.adminapi will be created
  + resource "google_compute_region_network_endpoint_group" "adminapi" {
      + id                    = (known after apply)
      + name                  = "adminapi"
      + network_endpoint_type = "SERVERLESS"
      + project               = "cw-en-verification-9"
      + region                = "us-central1"
      + self_link             = (known after apply)

      + cloud_run {
          + service = "adminapi"
        }
    }

  # module.en.google_compute_region_network_endpoint_group.apiserver will be created
  + resource "google_compute_region_network_endpoint_group" "apiserver" {
      + id                    = (known after apply)
      + name                  = "apiserver"
      + network_endpoint_type = "SERVERLESS"
      + project               = "cw-en-verification-9"
      + region                = "us-central1"
      + self_link             = (known after apply)

      + cloud_run {
          + service = "apiserver"
        }
    }

  # module.en.google_compute_region_network_endpoint_group.server will be created
  + resource "google_compute_region_network_endpoint_group" "server" {
      + id                    = (known after apply)
      + name                  = "server"
      + network_endpoint_type = "SERVERLESS"
      + project               = "cw-en-verification-9"
      + region                = "us-central1"
      + self_link             = (known after apply)

      + cloud_run {
          + service = "server"
        }
    }

  # module.en.null_resource.migrate is tainted, so must be replaced
-/+ resource "null_resource" "migrate" {
      ~ id = "7376094188326433111" -> (known after apply)
    }

Plan: 14 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ en = {
      ~ adminapi_url                    = "" -> (known after apply)
      ~ apiserver_url                   = "" -> (known after apply)
        cleanup_url                     = "https://cleanup-o22n3kqbfa-uc.a.run.app"
        cloudscheduler_location         = "us-central1"
        cookie_keys                     = "secret://projects/295454028483/secrets/cookie-hmac-key/versions/1,secret://projects/295454028483/secrets/cookie-encryption-key/versions/1"
        db_apikey_database_key_secret   = "secret://projects/295454028483/secrets/db-apikey-db-hmac/versions/1"
        db_apikey_signature_key_secret  = "secret://projects/295454028483/secrets/db-apikey-sig-hmac/versions/1"
        db_conn                         = "cw-en-verification-9:us-central1:en-verification"
        db_encryption_key_secret        = "projects/cw-en-verification-9/locations/us-central1/keyRings/verification/cryptoKeys/database-encrypter"
        db_host                         = "10.123.0.2"
        db_name                         = "verification"
        db_password                     = "projects/295454028483/secrets/db-password/versions/1"
        db_user                         = "verification"
        db_verification_code_key_secret = "secret://projects/295454028483/secrets/db-verification-code-hmac/versions/1"
      ~ e2e_runner_url                  = null -> (known after apply)
        firebase_api_key                = "AIzaSyB43Grz7xgOucC99JKprmDVHhNvrol-NlI"
        firebase_app_id                 = "1:295454028483:web:1b7975c50d53469d016876"
        firebase_auth_domain            = "cw-en-verification-9.firebaseapp.com"
        firebase_database_url           = "https://cw-en-verification-9.firebaseio.com"
        firebase_measurement_id         = ""
        firebase_messaging_sender_id    = "295454028483"
        firebase_project_id             = "cw-en-verification-9"
        firebase_storage_bucket         = "cw-en-verification-9.appspot.com"
        migrate_command                 = "PROJECT_ID=\"cw-en-verification-9\" DB_CONN=\"cw-en-verification-9:us-central1:en-verification\" DB_ENCRYPTION_KEY=\"projects/cw-en-verification-9/locations/us-central1/keyRings/verification/cryptoKeys/database-encrypter\" DB_APIKEY_DATABASE_KEY=\"secret://projects/295454028483/secrets/db-apikey-db-hmac/versions/1\" DB_APIKEY_SIGNATURE_KEY=\"secret://projects/295454028483/secrets/db-apikey-sig-hmac/versions/1\" DB_VERIFICATION_CODE_DATABASE_KEY=\"secret://projects/295454028483/secrets/db-verification-code-hmac/versions/1\" DB_PASSWORD=\"secret://projects/295454028483/secrets/db-password/versions/1\" DB_NAME=\"verification\" DB_USER=\"verification\" DB_DEBUG=\"true\" LOG_DEBUG=\"true\" ./scripts/migrate"
        next_steps                      = {
            enable_authentication_providers = "https://console.firebase.google.com/project/cw-en-verification-9/authentication/providers"
        }
        project_id                      = "cw-en-verification-9"
        project_number                  = "295454028483"
        proxy_command                   = "cloud_sql_proxy -dir \"${HOME}/sql\" -instances=cw-en-verification-9:us-central1:en-verification=tcp:5432"
        proxy_env                       = "DB_SSLMODE=disable DB_HOST=127.0.0.1 DB_NAME=verification DB_PORT=5432 DB_USER=verification DB_PASSWORD=$(gcloud secrets versions access projects/295454028483/secrets/db-password/versions/1)"
        psql_env                        = "PGHOST=127.0.0.1 PGPORT=5432 PGUSER=verification PGPASSWORD=$(gcloud secrets versions access projects/295454028483/secrets/db-password/versions/1)"
        redis_host                      = "10.123.1.4"
        redis_port                      = 6379
        region                          = "us-central1"
      ~ server_url                      = "" -> (known after apply)
    }


Warning: "bucket_policy_only": [DEPRECATED] Please use the uniform_bucket_level_access as this field has been renamed by Google.

  on .terraform/modules/en/terraform/build.tf line 15, in resource "google_storage_bucket" "cloudbuild-cache":
  15: resource "google_storage_bucket" "cloudbuild-cache" {


Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

module.en.null_resource.migrate: Destroying... [id=7376094188326433111]
module.en.null_resource.migrate: Destruction complete after 0s
module.en.null_resource.migrate: Creating...
module.en.null_resource.migrate: Provisioning with 'local-exec'...
module.en.null_resource.migrate (local-exec): Executing: ["/bin/sh" "-c" ".terraform/modules/en/terraform/../scripts/migrate"]
module.en.google_cloud_run_service.adminapi: Creating...
module.en.google_cloud_run_service.apiserver: Creating...
module.en.google_cloud_run_service.server: Creating...
module.en.null_resource.migrate (local-exec): Created [https://cloudbuild.googleapis.com/v1/projects/cw-en-verification-9/builds/9e7e8387-00d3-4ea6-9863-6fdd41ef7a2d].
module.en.null_resource.migrate (local-exec): Logs are available at [https://console.cloud.google.com/cloud-build/builds/9e7e8387-00d3-4ea6-9863-6fdd41ef7a2d?project=295454028483].
module.en.null_resource.migrate: Still creating... [10s elapsed]
module.en.google_cloud_run_service.adminapi: Still creating... [10s elapsed]
module.en.google_cloud_run_service.apiserver: Still creating... [10s elapsed]
module.en.null_resource.migrate: Still creating... [20s elapsed]
module.en.null_resource.migrate (local-exec): ERROR: (gcloud.builds.submit) build 9e7e8387-00d3-4ea6-9863-6fdd41ef7a2d completed with status "FAILURE"
module.en.null_resource.migrate (local-exec): ---------------------------------------------------------------------------------------------- REMOTE BUILD OUTPUT ----------------------------------------------------------------------------------------------
module.en.null_resource.migrate (local-exec): starting build "9e7e8387-00d3-4ea6-9863-6fdd41ef7a2d"

module.en.null_resource.migrate (local-exec): FETCHSOURCE
module.en.null_resource.migrate (local-exec): BUILD
module.en.null_resource.migrate (local-exec): Pulling image: gcr.io/cw-en-verification-9/github.com/google/exposure-notifications-verification-server/migrate:v0.7.0
module.en.null_resource.migrate (local-exec): Error response from daemon: manifest for gcr.io/cw-en-verification-9/github.com/google/exposure-notifications-verification-server/migrate:v0.7.0 not found: manifest unknown: Failed to fetch "v0.7.0" from request "/v2/cw-en-verification-9/github.com/google/exposure-notifications-verification-server/migrate/manifests/v0.7.0".
module.en.null_resource.migrate (local-exec): Error response from daemon: manifest for gcr.io/cw-en-verification-9/github.com/google/exposure-notifications-verification-server/migrate:v0.7.0 not found: manifest unknown: Failed to fetch "v0.7.0" from request "/v2/cw-en-verification-9/github.com/google/exposure-notifications-verification-server/migrate/manifests/v0.7.0".
module.en.null_resource.migrate (local-exec): Error response from daemon: manifest for gcr.io/cw-en-verification-9/github.com/google/exposure-notifications-verification-server/migrate:v0.7.0 not found: manifest unknown: Failed to fetch "v0.7.0" from request "/v2/cw-en-verification-9/github.com/google/exposure-notifications-verification-server/migrate/manifests/v0.7.0".
module.en.null_resource.migrate (local-exec): Error response from daemon: manifest for gcr.io/cw-en-verification-9/github.com/google/exposure-notifications-verification-server/migrate:v0.7.0 not found: manifest unknown: Failed to fetch "v0.7.0" from request "/v2/cw-en-verification-9/github.com/google/exposure-notifications-verification-server/migrate/manifests/v0.7.0".
module.en.null_resource.migrate (local-exec): Error response from daemon: manifest for gcr.io/cw-en-verification-9/github.com/google/exposure-notifications-verification-server/migrate:v0.7.0 not found: manifest unknown: Failed to fetch "v0.7.0" from request "/v2/cw-en-verification-9/github.com/google/exposure-notifications-verification-server/migrate/manifests/v0.7.0".
module.en.null_resource.migrate (local-exec): Error response from daemon: manifest for gcr.io/cw-en-verification-9/github.com/google/exposure-notifications-verification-server/migrate:v0.7.0 not found: manifest unknown: Failed to fetch "v0.7.0" from request "/v2/cw-en-verification-9/github.com/google/exposure-notifications-verification-server/migrate/manifests/v0.7.0".
module.en.null_resource.migrate (local-exec): Error response from daemon: manifest for gcr.io/cw-en-verification-9/github.com/google/exposure-notifications-verification-server/migrate:v0.7.0 not found: manifest unknown: Failed to fetch "v0.7.0" from request "/v2/cw-en-verification-9/github.com/google/exposure-notifications-verification-server/migrate/manifests/v0.7.0".
module.en.null_resource.migrate (local-exec): Error response from daemon: manifest for gcr.io/cw-en-verification-9/github.com/google/exposure-notifications-verification-server/migrate:v0.7.0 not found: manifest unknown: Failed to fetch "v0.7.0" from request "/v2/cw-en-verification-9/github.com/google/exposure-notifications-verification-server/migrate/manifests/v0.7.0".
module.en.null_resource.migrate (local-exec): Error response from daemon: manifest for gcr.io/cw-en-verification-9/github.com/google/exposure-notifications-verification-server/migrate:v0.7.0 not found: manifest unknown: Failed to fetch "v0.7.0" from request "/v2/cw-en-verification-9/github.com/google/exposure-notifications-verification-server/migrate/manifests/v0.7.0".
module.en.null_resource.migrate (local-exec): Error response from daemon: manifest for gcr.io/cw-en-verification-9/github.com/google/exposure-notifications-verification-server/migrate:v0.7.0 not found: manifest unknown: Failed to fetch "v0.7.0" from request "/v2/cw-en-verification-9/github.com/google/exposure-notifications-verification-server/migrate/manifests/v0.7.0".
module.en.null_resource.migrate (local-exec): ERROR: failed to pull because we ran out of retries.
module.en.null_resource.migrate (local-exec): ERROR
module.en.null_resource.migrate (local-exec): ERROR: build step 0 "gcr.io/cw-en-verification-9/github.com/google/exposure-notifications-verification-server/migrate:v0.7.0" failed: error pulling build step 0 "gcr.io/cw-en-verification-9/github.com/google/exposure-notifications-verification-server/migrate:v0.7.0": generic::unknown: retry budget exhausted (10 attempts): step exited with non-zero status: 1
module.en.null_resource.migrate (local-exec): -----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------



Error: Error running command '.terraform/modules/en/terraform/../scripts/migrate': exit status 1. Output: Created [https://cloudbuild.googleapis.com/v1/projects/cw-en-verification-9/builds/9e7e8387-00d3-4ea6-9863-6fdd41ef7a2d].
Logs are available at [https://console.cloud.google.com/cloud-build/builds/9e7e8387-00d3-4ea6-9863-6fdd41ef7a2d?project=295454028483].
ERROR: (gcloud.builds.submit) build 9e7e8387-00d3-4ea6-9863-6fdd41ef7a2d completed with status "FAILURE"
---------------------------------------------------------------------------------------------- REMOTE BUILD OUTPUT ----------------------------------------------------------------------------------------------
starting build "9e7e8387-00d3-4ea6-9863-6fdd41ef7a2d"

FETCHSOURCE
BUILD
Pulling image: gcr.io/cw-en-verification-9/github.com/google/exposure-notifications-verification-server/migrate:v0.7.0
Error response from daemon: manifest for gcr.io/cw-en-verification-9/github.com/google/exposure-notifications-verification-server/migrate:v0.7.0 not found: manifest unknown: Failed to fetch "v0.7.0" from request "/v2/cw-en-verification-9/github.com/google/exposure-notifications-verification-server/migrate/manifests/v0.7.0".
Error response from daemon: manifest for gcr.io/cw-en-verification-9/github.com/google/exposure-notifications-verification-server/migrate:v0.7.0 not found: manifest unknown: Failed to fetch "v0.7.0" from request "/v2/cw-en-verification-9/github.com/google/exposure-notifications-verification-server/migrate/manifests/v0.7.0".
Error response from daemon: manifest for gcr.io/cw-en-verification-9/github.com/google/exposure-notifications-verification-server/migrate:v0.7.0 not found: manifest unknown: Failed to fetch "v0.7.0" from request "/v2/cw-en-verification-9/github.com/google/exposure-notifications-verification-server/migrate/manifests/v0.7.0".
Error response from daemon: manifest for gcr.io/cw-en-verification-9/github.com/google/exposure-notifications-verification-server/migrate:v0.7.0 not found: manifest unknown: Failed to fetch "v0.7.0" from request "/v2/cw-en-verification-9/github.com/google/exposure-notifications-verification-server/migrate/manifests/v0.7.0".
Error response from daemon: manifest for gcr.io/cw-en-verification-9/github.com/google/exposure-notifications-verification-server/migrate:v0.7.0 not found: manifest unknown: Failed to fetch "v0.7.0" from request "/v2/cw-en-verification-9/github.com/google/exposure-notifications-verification-server/migrate/manifests/v0.7.0".
Error response from daemon: manifest for gcr.io/cw-en-verification-9/github.com/google/exposure-notifications-verification-server/migrate:v0.7.0 not found: manifest unknown: Failed to fetch "v0.7.0" from request "/v2/cw-en-verification-9/github.com/google/exposure-notifications-verification-server/migrate/manifests/v0.7.0".
Error response from daemon: manifest for gcr.io/cw-en-verification-9/github.com/google/exposure-notifications-verification-server/migrate:v0.7.0 not found: manifest unknown: Failed to fetch "v0.7.0" from request "/v2/cw-en-verification-9/github.com/google/exposure-notifications-verification-server/migrate/manifests/v0.7.0".
Error response from daemon: manifest for gcr.io/cw-en-verification-9/github.com/google/exposure-notifications-verification-server/migrate:v0.7.0 not found: manifest unknown: Failed to fetch "v0.7.0" from request "/v2/cw-en-verification-9/github.com/google/exposure-notifications-verification-server/migrate/manifests/v0.7.0".
Error response from daemon: manifest for gcr.io/cw-en-verification-9/github.com/google/exposure-notifications-verification-server/migrate:v0.7.0 not found: manifest unknown: Failed to fetch "v0.7.0" from request "/v2/cw-en-verification-9/github.com/google/exposure-notifications-verification-server/migrate/manifests/v0.7.0".
Error response from daemon: manifest for gcr.io/cw-en-verification-9/github.com/google/exposure-notifications-verification-server/migrate:v0.7.0 not found: manifest unknown: Failed to fetch "v0.7.0" from request "/v2/cw-en-verification-9/github.com/google/exposure-notifications-verification-server/migrate/manifests/v0.7.0".
ERROR: failed to pull because we ran out of retries.
ERROR
ERROR: build step 0 "gcr.io/cw-en-verification-9/github.com/google/exposure-notifications-verification-server/migrate:v0.7.0" failed: error pulling build step 0 "gcr.io/cw-en-verification-9/github.com/google/exposure-notifications-verification-server/migrate:v0.7.0": generic::unknown: retry budget exhausted (10 attempts): step exited with non-zero status: 1
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------





Error: Error waiting to create Service: resource is in failed state "Ready:False", message: Cloud Run error: Container failed to start. Failed to start and then listen on the port defined by the PORT environment variable. Logs for this revision might contain more information.

  on .terraform/modules/en/terraform/service_admin_apiserver.tf line 82, in resource "google_cloud_run_service" "adminapi":
  82: resource "google_cloud_run_service" "adminapi" {



Error: Error waiting to create Service: resource is in failed state "Ready:False", message: Cloud Run error: Container failed to start. Failed to start and then listen on the port defined by the PORT environment variable. Logs for this revision might contain more information.

  on .terraform/modules/en/terraform/service_apiserver.tf line 88, in resource "google_cloud_run_service" "apiserver":
  88: resource "google_cloud_run_service" "apiserver" {



Error: Error waiting to create Service: resource is in failed state "Ready:False", message: Cloud Run error: Container failed to start. Failed to start and then listen on the port defined by the PORT environment variable. Logs for this revision might contain more information.

  on .terraform/modules/en/terraform/service_server.tf line 119, in resource "google_cloud_run_service" "server":
 119: resource "google_cloud_run_service" "server" {


zsombor@MacBook-Pro cw-en-verification-9 % 
```

Cloud Run log of `server` (`adminapi` and `apiserver` is similar):

```
2020-09-10 01:16:33.518 EESTfailed to process config: Cache: HMACKey: failed to resolve "projects/295454028483/secrets/cache-hmac-key/versions/1": failed to access secret projects/295454028483/secrets/cache-hmac-key/versions/1: rpc error: code = PermissionDenied desc = Permission 'secretmanager.versions.access' denied for resource 'projects/295454028483/secrets/cache-hmac-key/versions/1' (or it may not exist).

2020-09-10 01:16:33.632 EESTContainer called exit(1).
```
